SOA/ESB labs/labs/lab6/data/submitpo.xml

<?xml version="1.0" ?> 
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://www.acmeOrders.com/OrderService">
 <env:Header>
 </env:Header>
 <env:Body>
  <tns:submitPORequest>
   <partNo>100-abc</partNo>
   <partQuantity>5</partQuantity>
   <personName>
    <firstName>Wiley</firstName>
    <lastName>Coyote</lastName>
   </personName>
   <address>
    <street>100 Warner St</street>
    <city>Burbank</city>
    <zipCode>95020</zipCode>
   </address>
  </tns:submitPORequest>
 </env:Body>
</env:Envelope>